<?php

namespace Database\Seeders;

use App\Models\MaCategory;
use App\Models\MaItem;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class LogBookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $ma_cates =
        [
            [
                'name' => 'เครื่องกำเนิดพลังงาน',
                'items' => [
                    'เครื่องยนต์, สายพาน, ระบบหล่อเย็น',
                    'น้ำมันเครื่อง, ใส้กรองน้ำมันเชื้อเพลิง',
                    'ใส้กรองอากาศ',
                    'ปรับตั้งวาล์ว',
                ],
            ],
            [
                'name' => 'ระบบไอเสีย',
                'items' => [
                    'ระบบไอเสีย',
                ],
            ],
            [
                'name' => 'ระบบส่งกำลังงาน',
                'items' => [
                    'ระบบส่งกำลังงาน, เพลาส่งกำลัง',
                    'ชุดเกียร์/เฟืองท้าย(น้ำมัน)'
                ],
            ],
            [
                'name' => 'ระบบบังคับเลี้ยว',
                'items' => [
                    'ระบบบังคับเลี้ยว, กลไกบังคับเลี้ยว, ศูนย์ล้อ',
                ],
            ],
            [
                'name' => 'ระบบห้ามล้อ',
                'items' => [
                    'ท่อทางต่างๆของระบบห้ามล้อ',
                    'ระบบห้ามล้อเท้า, ระบบห้ามล้อมือ',
                    'ผ้าเบรกและจานเบรก',
                ],
            ],
            [
                'name' => 'ระบบรองรับน้ำหนัก',
                'items' => [
                    'ระบบรองรับน้ำหนัก',
                    'เครื่องผ่อนคลายความสั่นสะเทือน',
                ],
            ],
            [
                'name' => 'ระบบไฟฟ้า ไฟส่องสว่างและไฟสัญญาณ',
                'items' => [
                    'เครื่องอุปรณ์และการเดินสายไฟ',
                    'แบตเตอรี่, ไดชาร์จ',
                    'แตรสัญญาณ',
                    'ไฟส่องสว่างและไฟสัญญาณ',
                ],
            ],
            [
                'name' => 'เพลาล้อ กงล้อและยาง',
                'items' => [
                    'เพลาล้อ กงล้อและยาง',
                    'ลูกปืนล้อ',
                ],
            ],
            [
                'name' => 'ตัวถัง',
                'items' => [
                    'ตัวถัง, กันชน, สีรถ, เครื่องหมาย',
                    'กระจก, ที่ปัดน้ำฝน, ตัวถังที่เป็นกระจก',
                    'ประตูทางขึ้น-ลงและประตูฉุกเฉิน',
                    'หลังคา, พื้นรถ, อุปกรณ์ตกแต่งภายใน',
                    'ที่นั่งและจุดยึดที่นั่ง, เข็มขัดนิรภัย',
                    'กระจกเงาหรืออุปกรณ์สำหรับมองสภาพการจราจร',
                    'ระบบปรับอากาศ',
                ],
            ],
            [
                'name' => 'ระบบเชื้อเพลิง',
                'items' => [
                    'ระบบเชื้อเพลิง',
                    'ถังเชื้อเพลิง',
                ],
            ],
        ];

        foreach ($ma_cates as $key => $cate) {
            $newCate = MaCategory::create([
                'name' => $cate['name']
            ]);
            foreach ($cate['items'] as $key => $item) {
                MaItem::create([
                    'name' => $item,
                    'cate_id' => $newCate->id
                ]);
            }
        }
    }
}
