<!DOCTYPE html>
<html lang="th">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>นโยบายความเป็นส่วนตัว</title>
    <style>

    </style>
</head>
<body>
    <div class="container">
        <h1>นโยบายความเป็นส่วนตัวสำหรับลูกค้า</h1>
        <p><strong>บริษัท ไอดี ไดร์ฟ จำกัด</strong> ให้ความสำคัญกับการคุ้มครองข้อมูลส่วนบุคคล โดยนโยบายความเป็นส่วนตัวฉบับนี้ได้อธิบายแนวปฏิบัติเกี่ยวกับการเก็บรวบรวมใช้ หรือเปิดเผยข้อมูลส่วนบุคคล รวมถึงสิทธิต่างๆของเจ้าของข้อมูลบุคคล ตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล</p>

        <h2>การเก็บรวบรวมข้อมูลส่วนบุคคล</h2>
        <p>เราจะเก็บรวบรวมข้อมูลส่วนบุคคลที่ได้รับโดยตรงจากคุณผ่านช่องทางดังต่อไปนี้:</p>
        <ul>
            <li>การสมัครสมาชิก</li>
            <li>ลงทะเบียน</li>
            <li>โทรศัพท์</li>
            <li>อีเมล์</li>
        </ul>

        <h2>ประเภทข้อมูลส่วนบุคคลที่เก็บรวบรวม</h2>
        <ul>
            <li>ข้อมูลส่วนบุคคล เช่น ชื่อ นามสกุล อายุ วันเดือนปีเกิด เลขบัตรประจำตัวประชาชน หนังสือเดินทาง เป็นต้น</li>
            <li>ข้อมูลการติดต่อ เช่น ที่อยู่ หมายเลขโทรศัพท์ อีเมล์ เป็นต้น</li>
            <li>ข้อมูลบัญชี เช่น บัญชีผู้ใช้งาน เป็นต้น</li>
            <li>ข้อมูลการทำธุรกรรมและการเงิน เช่น ประวัติการสั่งซื้อ รายละเอียดบัตรเครดิต บัญชีธนาคาร เป็นต้น</li>
            <li>ข้อมูลทางเทคนิค เช่น IP address, Cookie ID, ประวัติการใช้งานเว็บไซต์ (Activity Log) เป็นต้น</li>
            <li>ข้อมูลอื่นๆ เช่น รูปภาพ ภาพเคลื่อนไหว และข้อมูลอื่นที่ถือว่าเป็นข้อมูลส่วนบุคคลตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล</li>
        </ul>
        <p>เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลอ่อนไหว ดังต่อไปนี้ เมื่อเราได้รับความยินยอม โดยชัดแจ้งจากคุณ เว้นแต่กฎหมายกำหนดให้ทำได้</p>

        <h2>ผู้เยาว์</h2>
        <p>หากคุณมีอายุต่ำกว่า 20 ปีหรือมีข้อจำกัดความสามารถตามกฎหมาย เราอาจเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ เราอาจจำเป็นต้องให้พ่อแม่หรือผู้ปกครองของคุณให้ความยินยอมหรือที่กฎหมายอนุญาตให้ทำได้ หากเราทราบว่าการเก็บรวบรวมข้อมูลส่วนบุคคลจากผู้เยาว์โดยไม่ได้รับความยินยอมจากพ่อแม่หรือผู้ปกครอง เราจะดำเนินการลบข้อมูลออกจากเซิร์ฟเวอร์ของเรา</p>

        <h2>วิธีการเก็บรักษาข้อมูลส่วนบุคคล</h2>
        <p>เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณในรูปแบบเอกสารและรูปแบบอิเล็กทรอนิกส์</p>
        <p>เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณ ดังต่อไปนี้</p>
        <ul>
            <li>เซิร์ฟเวอร์บริษัทของเราในต่างประเทศ</li>
            <li>ผู้ให้บริการเซิร์ฟเวอร์ในต่างประเทศ</li>
        </ul>

        <h2>การประมวลผลข้อมูลส่วนบุคคล</h2>
        <p>เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์ดังต่อไปนี้</p>
        <ul>
            <li>เพื่อจัดส่งสินค้าหรือบริการ</li>
            <li>เพื่อปรับปรุงสินค้า บริการ หรือประสบการณ์การใช้งาน</li>
            <li>เพื่อบริหารจัดการภายในบริษัท</li>
            <li>เพื่อการบริการหลังการขาย</li>
            <li>เพื่อรวบรวมข้อเสนอแนะ</li>
            <li>เพื่อปฏิบัติตามข้อตกลงและเงื่อนไข (Terms and Conditions)</li>
            <li>เพื่อปฏิบัติตามกฎหมายและกฎระเบียบของบริษัทราชการ</li>
        </ul>

        <h2>การเปิดเผยข้อมูลส่วนบุคคล</h2>
        <p>เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณให้แก่ผู้อื่นภายใต้ความยินยอมของคุณหรือที่กฎหมายอนุญาตให้เปิดเผยได้ ดังต่อไปนี้</p>

        <h2>การบริหารจัดการภายในบริษัท</h2>
        <p>เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณภายในบริษัทเท่าที่จำเป็นเพื่อปรับปรุงและพัฒนาสินค้าหรือบริการของเรา เราอาจรวบรวมข้อมูลภายในสินค้าหรือบริการต่างๆภายใต้นโยบายนี้เพื่อประโยชน์ของคุณและผู้อื่นมากขึ้น</p>

        <h2>ระยะเวลาจัดเก็บข้อมูลส่วนบุคคล</h2>
        <p>เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณไว้ตามระยะเวลาที่จำเป็นในระหว่างที่คุณเป็นลูกค้าหรือมีความสัมพันธ์อยู่กับเราหรือตลอดระยะเวลาที่จำเป็นเพื่อวัตถุประสงค์ที่เกี่ยวข้องกับนโยบายฉบับนี้ ซึ่งอาจจะจำเป็นต้องเก็บรักษาไว้ต่อไปภายหลังจากนั้น หากมีกฎหมายกำหนดไว้ เราจะลบ ทำลาย หรือทำให้เป็นข้อมูลที่ไม่สามารถระบุตัวตนของคุณได้ เมื่อหมดความจำเป็นหรือสิ้นระยะเวลาดังกล่าว</p>

        <h2>สิทธิของเจ้าของข้อมูลส่วนตัว</h2>
        <p>ภายใต้กฎหมายคุ้มครองข้อมูลส่วนบุคคล คุณมีสิทธิในการดำเนินการดังต่อไปนี้</p>
        <ul>
            <li><b>สิทธิขอถอนความยินยอม</b>: (right to withdraw consent) หากคุณได้ให้ความยินยอม เราจะเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ ไม่ว่าจะเป็นความยินยอมที่คุณให้ไว้ก่อนวันที่กฎหมายคุ้มครองข้อมูลส่วนบุคคลใช้บังคับหรือหลังจากนั้น คุณมีสิทธิที่จะถอนความยินยอมเมื่อใดก็ได้ตลอดเวลา</li>
            <li><b>สิทธิขอเข้าถึงข้อมูล (Right to access)</b>: คุณมีสิทธิขอเข้าถึงข้อมูลส่วนบุคคลของคุณที่อยู่ในความรับผิดชอบของเราและขอให้เราทำสำเนาข้อมูลดังกล่าวได้</li>
            <li><b>สิทธิขอถ่ายโอนข้อมูล (Right to data portability)</b>: คุณมีสิทธิขอรับข้อมูลส่วนบุคคลของคุณในกรณีที่เราได้จัดทำข้อมูลส่วนบุคคลนั้นอยู่ในรูปแบบให้สามารถอ่านหรือใช้งานได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทำงานได้โดยอัตโนมัติและสามารถใช้หรือเปิดเผยข้อมูลส่วนบุคคลได้ด้วยวิธีการอัตโนมัติ รวมทั้งมีสิทธิขอให้เราส่งหรือโอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นเมื่อสามารถทำได้ และมีสิทธิขอรับข้อมูลส่วนบุคคลที่เราส่งหรือโอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นโดยตรง เว้นแต่ไม่สามารถดำเนินการได้เพราะเหตุทางเทคนิค</li>
            <li><b>สิทธิขอคัดค้าน (Right to object)</b>: คุณมีสิทธิขอคัดค้านด้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณในเวลาใดก็ได้ หากการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของคุณที่ทำขึ้นเพื่อการดำเนินงานที่จำเป็นภายใต้ประโยชน์โดยชอบด้วยกฎหมายของเราหรือของบุคคลหรือนิติบุคคลอื่น โดยเกินขอบเขตที่คุณสามารถคาดหมายได้อย่างสมเหตุสมผลหรือเพื่อดำเนินการตามภารกิจเพื่อประโยชน์</li>
            <li><b>สิทธิขอให้ลบหรือทำลายข้อมูล (Right to erasure/destruction)</b>: คุณมีสิทธิขอลบหรือทำลายข้อมูลส่วนบุคคลของคุณหรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวคุณได้ หากคุณเชื่อว่าข้อมูล ส่วนบุคคลของคุณถูกเก็บรวบรวม ใช้ หรือเปิดเผยโดยไม่ชอบด้วยกฎหมายที่เกี่ยวข้องหรือเห็นว่าเราหมดความจำเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ที่เกี่ยวข้องในนโยบายฉบับนี้ หรือเมื่อคุณได้ใช้สิทธิขอถอนความยินยอมหรือขอใช้สิทธิคัดค้านตามที่แจ้งไว้ข้างต้นแล้ว</li>
            <li><b>สิทธิขอระงับการใช้ข้อมูล (right to restriction processing)</b>: คุณมีสิทธิขอให้ระงับการใช้ข้อมูลส่วนบุคคลชั่วคาราวในกรณีที่เราอยู่ระหว่างตรวจสอบตามคำร้องขอใช้สิทธิขอแก้ไขข้อมูลส่วนบุคคลหรือขอคัดค้านของคุณหรือกรณีอื่นใดที่เราหมดความจำเป็นและต้องลบหรือทำลายข้อมูลส่วนบุคคลของคุณตามกฎหมายที่เกี่ยวข้องแต่คุณขอให้เราระงับการใช้แทน</li>
            <li><b>สิทธิขอให้แก้ไขข้อมูล (right to rectification)</b>: คุณมีสิทธิขอแก้ไขข้อมูลส่วนบุคคลของคุณให้ถูกต้อง เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด</li>
            <li><b>สิทธิร้องเรียน (right to lodge a complaint)</b>: คุณมีสิทธิร้องเรียนหรือต่อผู้มีอำนาจตามกฎหมายที่เกี่ยวข้อง หากคุณเชื่อว่าการรวบรวมข้อมูลส่วนบุคคลของคุณ เป็นการกระทำในลักษณะที่ฝ่าฝืนหรือไม่ปฏิบัติตามกฎหมายที่เกี่ยวข้อง</li>
        </ul>
        <p>คุณสามารถใช้สิทธิของคุณในฐานะเจ้าของข้อมูลส่วนบุคคลข้างต้นได้ โดยติดต่อมาที่เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลของเราตามรายละเอียดท้ายนโยบายนี้ เราจะแจ้งผลการดำเนินการภายในระยะเวลา 30 วัน นับตั้งแต่วันที่เราได้รับคำขอใช้สิทธิจากคุณ ตามแบบฟอร์มหรือวิธีการที่เรากำหนด ทั้งนี้ หากเราปฏิเสธคำขอเราจะแจ้งเหตุผลของการปฏิเสธให้คุณทราบผ่านช่องทางต่างๆ เช่น ข้อความ (SMS) อีเมล์ โทรศัพท์ จดหมาย เป็นต้น</p>

        <h2>การรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล</h2>
        <p>เราจะรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลของคุณไว้ตามหลักการ การรักษาความลับ (confidentiality) ความถูกต้องครบถ้วน (integrity)  และสภาพพร้อมใช้งาน (availability) ทั้งนี้ เพื่อป้องกันการสูญหาย เข้าถึง ใช้ เปลี่ยนแปลง แก้ไข หรือเปิดเผย นอกจรากนี้เราจะจัดให้มีมาตรการการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล ซึ่งครอบคลุมถึงมาตรการการป้องกันดานการบริหารจัดการ (administrative safeguard) มาตรการป้องกันด้านเทคนิค (technical safeguard) และมาตรการป้องกันทางกายภาพ (physical safeguard) ในเรื่องการเข้าถึงหรือควบคุมการใช้งานข้อมูลส่วนบุคคล (access control)</p>

        <h2>การแจ้งเหตุละเมิดข้อมูลส่วนบุคคล</h2>
        <p>ในกรณีที่มีเหตุละเมิดข้อมูลส่วนบุคคลของคุณเกิดขึ้น เราจะแจ้งให้สำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลทราบโดยไม่ชักช้าภายใน 72 ชม. นับตั้งแต่ ทราบเหตุเท่าที่สามารถกระทำได้ ในกรณีที่การละเมิดมีความเสี่ยงสูงที่จะมีผลกระทบต่อสิทธิและเสรีภาพของคุณ เราจะแจ้งการละเมิดให้คุณทราบพร้อมกับแนวทางการเยียวยาโดยไม่ชักช้าผ่านช่องทางต่างๆ เช่น เว็บไซต์ ข้อความ (SMS) อีเมล์ โทรศัพท์ จดหมาย เป็นต้น</p>

        <h2>การแก้ไขเปลี่ยนแปลงนโยบายความเป็นส่วนตัว</h2>
        <p>เราอาจแก้ไขเปลี่ยนแปลงนโยบายนี้เป็นครั้งคราว โดยคุณสามารถทราบข้อกำหนดและเงื่อนไขนโยบายที่มีการแก้ไขเปลี่ยนแปลงนี้ได้ผ่านทางเว็บไซต์ของเรา นโยบายนี้แก้ไขแก้ไขล่าสุดและมีผลใช้บังคับตั้งแต่วันที่ 09 มิถุนายน 2565</p>

        <h2>นโยบายความเป็นส่วนตัวของเว็บไซต์อื่น</h2>
        <p>นโยบายความเป็นส่วนตัวฉบับนี้ใช้สำหรับเสนอสินค้า บริการ และการใช้งานบนเว็บไซต์สำหรับลูกค้าของเราเท่านั้น หากคุณเข้าชมเว็บไซต์อื่นแม้จะผ่านช่องทางเว็บไซต์ของเรา การคุ้มครองข้อมูลส่วนบุคคลต่างๆจะเป็นไปตามนโยบายความเป็นส่วนตัวของเว็บไซต์นั้น ซึ่งเราไม่มีส่วนเกี่ยวข้องด้วย</p>

        <h2>รายละเอียดการติดต่อ</h2>
        <p>หากคุณต้องการสอบถามข้อมูลเกี่ยวกับนโยบายความเป็นส่วนตัวฉบับนี้ รวมถึงการขอใช้สิทธิต่างๆคุณสามารถติดต่อเราหรือเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลของเราได้ ดังนี้</p>
        <p><strong>บริษัท ไอดี ไดร์ฟ จำกัด</strong></p>
        <p>200/222 หมู่2 ถนนชัยพฤกษ์ ในเมือง เมืองขอนแก่น ขอนแก่น 40000</p>
        <p>อีเมล์: <a href="mailto:dpo@iddrives.co.th">dpo@iddrives.co.th</a></p>
        <p>เว็บไซต์: <a href="http://www.dsmsys.net/idmskk" target="_blank">http://www.dsmsys.net/idmskk</a></p>
        <p>หมายเลขโทรศัพท์: 043-228-899</p>
    </div>
</body>
</html>
